app/views/admin_v2/admin/index.html.erb

SELECT COUNT(*) FROM "alerts"
---
       		<td data-th="Alertes" >Alertes</td>
            <td data-th="Nombre d'alertes" ><%= @alerts.count %></td>