app/views/admin_v2/users/index.html.erb

SELECT "users".* FROM "users"
---
          <% end %>
          <% if user.role == "student" && user.users_info.present? %>