app/views/admin_v2/interview/index.html.erb

SELECT "applicant_statuses".* FROM "applicant_statuses"  WHERE ("applicant_statuses"."interview_date" IS NOT NULL)
---
        <%= link_to(admin_v2_applicants_path(ApplicantStatus.getapplicant(interview.id_applicant)), :class=>'') do %>
            <i class="fa fa-eye"></i> <span class="text-capitalize"><%= ApplicantStatus.getapplicant(interview.id_applicant).first_name %></span> <span class="text-uppercase"><%=  ApplicantStatus.getapplicant(interview.id_applicant).name %></span> à <%= interview.interview_date.to_time.strftime("%Hh%M") %>