app/controllers/admin_v2/actualities_controller.rb

  def index
    @actualities = Actuality.all
---
SELECT "actualities".* FROM "actualities"