app/controllers/admin_v2/alerts_controller.rb

SELECT "alerts".* FROM "alerts"
---
  def index
    # == Admin restriction == #
    admin_restriction_area
    @title_admin = "Alertes"
    @alerts = Alert.all