app/controllers/admin_v2/companies_controller.rb

SELECT "companies".* FROM "companies"
---
	def index
		@title_admin = "Entreprises"
		@companies = Company.all