app/controllers/admin_v2/interview_controller.rb

SELECT "applicant_statuses".* FROM "applicant_statuses"  WHERE ("applicant_statuses"."interview_date" IS NOT NULL)
SELECT "applicant_statuses".* FROM "applicant_statuses"  WHERE "applicant_statuses"."interview_date" IS NULL AND "applicant_statuses"."ok_for_interview" = 't'
---
  def index
    @title_admin = "Entretien"
    @status_interview = ApplicantStatus.all().where.not('applicant_statuses.interview_date' => nil)
    @status_interview_nil = ApplicantStatus.all().where('applicant_statuses.interview_date' => nil,'applicant_statuses.ok_for_interview' => true)