app/controllers/admin_v2/projects_controller.rb

  def index
    # == Admin restriction == #
    @title_admin = "projets"
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def create
    # == Admin restriction == #
    admin_restriction_area
    @title_admin = "Projet"
    @project = Project.new(params[:project].permit(:photo, :name, :description, :link, :thumbmail))
    if @project.save
---
INSERT INTO "projects" ("created_at", "description", "link", "name", "thumbmail_content_type", "thumbmail_file_name", "thumbmail_file_size", "thumbmail_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)