app/controllers/admin_v2/tips_controller.rb

SELECT "tips".* FROM "tips"
---
	def index
		@tips = Tip.all