app/controllers/admin_v2/users_controller.rb

  def update
    if @user.update_without_password(user_params)
---
UPDATE "users" SET "description" = ?, "lastname" = ?, "linkin" = ?, "name" = ?, "profile_picture_content_type" = ?, "profile_picture_file_name" = ?, "profile_picture_file_size" = ?, "profile_picture_updated_at" = ?, "twitter" = ?, "updated_at" = ? WHERE "users"."id" = 1