app/controllers/actualities_controller.rb

  def index
    @actualities = Actuality.order(:id)
---
SELECT "actualities".* FROM "actualities"   ORDER BY "actualities"."id" ASC