app/controllers/admin_controller.rb

  def index
    @title_admin = "Dashboard"
    @users = User.all
    @projects = Project.all
    @alerts = Alert.all
    @applicants = Applicant.all
    @lasts = Applicant.last(5).reverse
---
SELECT "applicants".* FROM "applicants"
SELECT  "applicants".* FROM "applicants"   ORDER BY "applicants"."id" DESC LIMIT 5