app/controllers/pages_controller.rb

SELECT  "actualities".* FROM "actualities"   ORDER BY "actualities"."id" DESC LIMIT 3
SELECT  "projects".* FROM "projects"   ORDER BY "projects"."id" DESC LIMIT 4
---
  def home
     @actualities = Actuality.all().order(id: :desc).limit(3)
     @projects = Project.all().order(id: :desc).limit(4)

SELECT "projects".* FROM "projects"   ORDER BY "projects"."id" ASC
---
  def project
    @projects = Project.all().order(id: :desc)

SELECT "users".* FROM "users"  WHERE "users"."role" = 'intervenant'
---
  def team
    @intervenants = User.where(role: 'intervenant')