app/controllers/sessions_controller.rb

	def create
		@user = User.find_for_database_authentication(email:sign_in_params[:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'admin@mail.com'  ORDER BY "users"."id" ASC LIMIT 1