app/controllers/tips_controller.rb

  def index
      #Permet de récupérer tous les différents types de Tip
      @diff_category = Tip.uniq.pluck(:category)
---
SELECT DISTINCT "tips"."category" FROM "tips"