app/views/admin_v2/applicants/index.html.erb

  <ul class="dropdown-menu" aria-labelledby="dropdownMenu1">
    <% Applicant.all_years.each do |year| %>
---
SELECT "applicants".* FROM "applicants"  WHERE (strftime('%Y', created_at) = '2016')